{"ast":null,"code":"import _JSXStyle from \"styled-jsx/style\";\nvar __jsx = React.createElement;\nimport Layout from '../components/Layout';\nimport React, { components, useRef, Component } from 'react';\nimport { motion } from 'framer-motion';\n\nclass About extends Component {\n  constructor() {\n    super();\n  }\n\n  render() {\n    return __jsx(Layout, null, __jsx(\"div\", {\n      className: \"jsx-84324450\" + \" \" + \"title\"\n    }, __jsx(motion.div, {\n      initial: {\n        opacity: 0,\n        y: -50\n      },\n      animate: {\n        opacity: 1,\n        y: 0\n      },\n      transition: {\n        duration: 0.5\n      }\n    }, __jsx(\"h1\", {\n      className: \"jsx-84324450\" + \" \" + \"ptitle\"\n    }, \"About\")), __jsx(motion.div, {\n      initial: {\n        opacity: 0,\n        x: -50\n      },\n      animate: {\n        opacity: 1,\n        x: 0\n      },\n      transition: {\n        duration: 1\n      }\n    }, __jsx(\"p\", {\n      className: \"jsx-84324450\"\n    }, \"Item motif bows tailor look skirt signature wholesale craftmanship. Extraordinary hippie trade imagination commercial synthetic production. Garment beautiful posture jersey color necessity jeans ready-made revealing tailored buttons. Wardrobe bodice effect jewelry model apron pastel buttons label. Artificial jumper swim-wear unique. Glossy synthetic commercial trend clothes comfortable wholesale taste artificial bargain. Artistic classic modern contemporary waistline jeans. Zipper condition limited artistic production wholesale bows trademark hanger pattern measurement. Swag imprint hippie purse catwalk impeccable. Industry phenomenon emphasis ribbon fashion inspiration bold mode availability jumper easy signature elegant casual. Look independant jewelry proportion wholesale handbag trademark. Wholesale urban waistline vogue imagination fashion effect bows. Contemporary piece jumper luxurious adjustment urban necessity commercial conservative quantity brand clothing. Bold ribbon old-fashioned bodice ready-made imprint retailer. Buttons celebrities clothes elegant. Jumper proportion imprint celebrities accessory hair. Trend urban popular glitter piece hair ready-made item brand conformity one-of-a-kind purchase conservative ribbon. Sari independant production etiquette. Shade emphasis showcase leotard sportswear halter ribbon. Braiding independant bows manufacture shawl conformity fashion couture embroidery classic retailer. Signature easy effect braiding xs. Beautiful jeans shade outfit pastel couture make up ensemble old-fashioned clothing. Fashion artificial sportswear affection popular piece pattern independant Haute-couture inspiration embroidery modification. Shape garment accessory necessity limited. Shape bargain availability trade ready-made allure swag phenomenon purchase luxurious trendwatching value. Garment hanger expensive. Stock conservative instagram apron hanger measurement pastel outlet trademark contemporary limited. Shawl affection phenomenon apparel impeccable radical stitching retailer prediction. Illustration apron sportswear collection combination identity bodice showcase leotard. Wholesale lingerie glossy runway vintage piece artistry sewing retailer bodice item.\")), __jsx(motion.div, {\n      initial: {\n        opacity: 0,\n        x: 50\n      },\n      animate: {\n        opacity: 1,\n        x: 0\n      },\n      transition: {\n        duration: .5,\n        delay: 1\n      }\n    }, __jsx(\"p\", {\n      className: \"jsx-84324450\" + \" \" + \"author\"\n    }, \"-ANTi\"))), __jsx(_JSXStyle, {\n      id: \"84324450\"\n    }, [\".author.jsx-84324450{font-weight:600;text-align:right;margin-top:2em;font-size:20pt;font-family:\\\"Rock Salt\\\";}\", \"p.jsx-84324450{padding:0;margin:0;}\", \".title.jsx-84324450{width:80%;margin:0 auto;height:calc(100vh - 178px);}\", \".ptitle.jsx-84324450{margin:0;padding:2em 0;text-align:center;text-transform:uppercase;font-size:24pt;color:#f1eee9;}\"]));\n  }\n\n}\n\nexport default About;","map":null,"metadata":{},"sourceType":"module"}